"""
Вывести таблицу умножения в виде:
1 х 1 = 1
1 х 2 = 2
...
1 х 10 = 10
-----
2 х 1 = 2
2 х 2 = 4
...
N х 10 = 10N

Параметр N задаётся с клавиатуры (или в виде аргумента скрипта, по желанию).
Между разделами вывести разделитель в виде 5 дефисов
"""

ONE = 1
TEN = 10


def mult_table(n: int) -> None:
    for i in range(ONE, n + ONE):
        for j in range(ONE, TEN + ONE):
            print(f'{i} x {j} = {i * j}')
        print('-' * 5)


if __name__ == '__main__':
    mult_table(int(input('Введите число: ')))
